Revit 2027 API
Family.CanLoadFamilies Method
 Checks whether the document is in a state that allows the loading of families.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanLoadFamilies(
	Document document
)
Public Shared Function CanLoadFamilies (
	document As Document
) As Boolean
public:
static bool CanLoadFamilies(
	Document^ document
)
static member CanLoadFamilies :
        document : Document -> bool
Parameters
document Document
 The document to check.
Return Value
Boolean
 True if loading of families is allowed, otherwise False.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace